{
  "transformers_version": "5.5.3",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "output_hidden_states": false,
  "return_dict": true,
  "dtype": "bfloat16",
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "problem_type": null,
  "vocab_size": 49152,
  "hidden_size": 576,
  "intermediate_size": 1536,
  "num_hidden_layers": 30,
  "num_attention_heads": 9,
  "num_key_value_heads": 3,
  "hidden_act": "silu",
  "max_position_embeddings": 8192,
  "initializer_range": 0.041666666666666664,
  "rms_norm_eps": 1e-05,
  "use_cache": true,
  "pad_token_id": null,
  "bos_token_id": 0,
  "eos_token_id": 0,
  "pretraining_tp": 1,
  "tie_word_embeddings": true,
  "rope_parameters": {
    "rope_theta": 100000,
    "rope_type": "default"
  },
  "attention_bias": false,
  "attention_dropout": 0.0,
  "mlp_bias": false,
  "head_dim": 64,
  "_name_or_path": "HuggingFaceTB/SmolLM2-135M",
  "is_llama_config": true,
  "model_type": "llama",
  "rope_interleaved": false,
  "output_attentions": false
}